app/views/peliculas/show.html.erb


    <%=  @pelicula.funcions.map do |item|%>
---
SELECT "funcions".* FROM "funcions" WHERE "funcions"."pelicula_id" = ?  [["pelicula_id", 3]]