app/views/usuarios/_usuario.html.erb

    <strong>Entradas:</strong>
    <%=  usuario.entradas.map do |item|%>
---
SELECT "entradas".* FROM "entradas" WHERE "entradas"."usuario_id" = ?  [["usuario_id", 1]]