app/controllers/peliculas_controller.rb

  def index
    @peliculas = Pelicula.all
---
SELECT "peliculas".* FROM "peliculas"

  def create
    @pelicula = Pelicula.new(pelicula_params)

    respond_to do |format|
      if @pelicula.save
---
INSERT INTO "peliculas" ("titulo", "descripcion", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def set_pelicula
      @pelicula = Pelicula.find(params[:id])
---
SELECT "peliculas".* FROM "peliculas" WHERE "peliculas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]