app/controllers/usuarios_controller.rb

SELECT "usuarios".* FROM "usuarios"
---
  def index
    @usuarios = Usuario.all

INSERT INTO "usuarios" ("nombre", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "juan"], ["email", "juan@mail.com"], ["password", "[FILTERED]"], ["created_at", "2022-05-28 16:00:44.110260"], ["updated_at", "2022-05-28 16:00:44.110260"]]
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_usuario
      @usuario = Usuario.find(params[:id])